{
	"myplate": [
		{
			"title": "Apple-Stuffed Squash",
			"comments": []
		},
		{
			"title": "Applesauce",
			"comments": []
		},
		{
			"title": "Applesauce Cookies",
			"comments": [
				"I received 2 cups of homemade applesauce from a friend and wanted to make cookies that used it up, and found this recipe which used most of it.  The only changes I made to the recipe was to add more raisins and 2 handfuls of shredded coconut ... came out delicious! <br/>Before making the recipe, I looked over the reviews and even though someone gave it a one star, I decided to try it anyway ... I can't understand anyone wanting to add more flour ... they must like eating bricks.  I go for moist food, myself. :-)",
				"I followed the recipe \"as is\" to make cakes. They were moist, delicious, and popular with participants. I'll see how the batter does as cookies next.",
				"The recipe was a little too wet, but once they are baked they are mini cake-like \"cookies.\" <br/>Kids absolutely loved them and I would definitely make them again.  <br/> <br/>"
			]
		},
		{
			"title": "Applesauce Loaf Cake",
			"comments": [
				"To save a step, I didn't toast the walnuts and it still turned out great!"
			]
		},
		{
			"title": "Applesauce Pancakes",
			"comments": []
		},
		{
			"title": "Argentinian Chimichurri Sauce",
			"comments": []
		},
		{
			"title": "Asparagus with Gremolata Sauce",
			"comments": [
				"I have substituted this recipes for the more calorie laden cheese sauce and asparagus and my family enjoy it just as much"
			]
		},
		{
			"title": "Au Gratin Potatoes",
			"comments": [
				"I've made the creamy version many times & always comes out great.  We enjoy it as a one dish meal by added chopped turkey bacon & a little extra shredded cheese between the layers.  This is definitely one of those versatile dishes that is inexpensive to experiment with. :)"
			]
		},
		{
			"title": "Aunt Barbara's Chocolate Squash Cake",
			"comments": []
		},
		{
			"title": "Autumn Vegetable Succotash",
			"comments": [
				"Saying the size of the skillet would help; I wanted less corn and limas, and glad I did!!! <br/>Needs a large, deep, skillet. <br/>Takes a long time to cook, or, did for me. <br/>Seasoning with dried sage okay, added some marjoram too."
			]
		},
		{
			"title": "Avocado and Corn Salsa",
			"comments": []
		},
		{
			"title": "Awesome Granola",
			"comments": [
				"I used this recipe in my nutrition class every year when we studied the grain group.  My students liked it so much they went home to make it. When they make it at home, you know it's a great recipe. It was give to me by the Cameron County Extension agent.",
				"it was less costly to make than to buy this granola in the stores, i can add what i want or take off the things i don't need."
			]
		},
		{
			"title": "Baked Apples and Sweet Potatoes",
			"comments": [
				"I substituted cinnamon for the nutmeg the second time I made this and liked it much better.",
				"Reduce the sugar probably the honey is enough sweeting and definitely healthier.",
				"Why would one add sugar to a recipe with apples and sweet potatoes?  I find it plenty sweet and delicious with out the sugar and honey."
			]
		},
		{
			"title": "Baked Beans",
			"comments": [
				"When you take into account the cost of each item you will be using you hit between 5 and 7 dollars depending on where you buy the beans and molasses. I have no idea of taste because once I sat and calculated the cost, it was way to expensive for me to buy the ingredients"
			]
		},
		{
			"title": "Baked Lentils Casserole",
			"comments": [
				"Lentils and cheese... my two favorite foods! YUM. I put this on top of a brown/wild rice mixture.",
				"I just couldn't finish this casserole. It has no flavor. The lentils were not cooked within the given amount of time. I even tried putting in the lentils in for another 15 minutes, after the cheese was put on top. It didn't work.",
				"i would added some kind of meat to this recipe <br/>"
			]
		},
		{
			"title": "Baked Potatoes Primavera",
			"comments": []
		},
		{
			"title": "Baked Pumpkin",
			"comments": [
				"I looooove pumpkin and wish that more people would eat their pumpkins rather than just decorate them and then throw them away. Pumpkin is so tasty and this recipe was so easy -- even for someone not used to eating pumpkin.",
				"its very easy to make and tastes really good - thank you !"
			]
		},
		{
			"title": "Baked Tofu",
			"comments": [
				"Thanks for the great tip on getting some of the water out of the tofu. That really helped. I added more ginger and less soy sauce to my dish.",
				"The recipe would be improved if the regular soy sauce was replaced with reduced sodium soy sauce.   There is too much sodium in regular soy sauce for this recipe to be healthy.",
				"After putting the block of tofu between paper toweling I placed a light weight on top for 10 minutes to further reduce the water content. <br/>I set the slices back in the plastic container it came in and poured the marinating solution over the slices and let them soak for at least 15 minutes.  <br/>This recipe works nice as a meat  <br/>substitute for stir fry. When the Tofu is done just cut in chunks and add to vegetables that you have stir fried."
			]
		},
		{
			"title": "Baked Tortilla Chips",
			"comments": []
		},
		{
			"title": "Banana Bread",
			"comments": [
				"1 tsp salt should be reduced to pinch of salt or 1/4 tsp salt. <br/>",
				"Delicious and easy recipe,  I added 1 tsp vanilla flavoring and 1 tsp cinnamon.  Not too sweet which I like.",
				"Very healthy, low cost ingredients."
			]
		},
		{
			"title": "Banana Cupcakes",
			"comments": [
				"I substituted 1/2 applesauce for the shortening and 1/2 c wheat flour for the flour. Added a dash of cinnamon."
			]
		},
		{
			"title": "Banana Oat Cookies",
			"comments": []
		},
		{
			"title": "Banana Oatmeal Pancakes with Lentils",
			"comments": []
		},
		{
			"title": "Banana Oatmeal Raisin Cookies",
			"comments": [
				"I agree that these are bland; the bananas' sweetness wasn't enough. I used craisins instead of raisins, didn't perk them up either. And they never looked baked. I will try the recipe again with 1/8 t salt, and some cinnamon!",
				"I did alter the recipe slightly. I added less than 1/8 teaspoon of salt, and that enhanced the flavor greatly."
			]
		},
		{
			"title": "Banana Pancakes with Apple Topping",
			"comments": [
				"The pancakes tasted very good. The apple topping took a while to make, but was a good addition. Little hard to chew through the apple skin. If you blend the bananas up, people don't even notice them in the pancakes."
			]
		},
		{
			"title": "Banana Split Oatmeal",
			"comments": []
		},
		{
			"title": "Banana Waldorf",
			"comments": [
				"I used vanilla light and fit yogurt.  Recipe is super easy and delicious!  My family loved it!",
				"The recipe was delicious and simple."
			]
		},
		{
			"title": "Banana Walnut Oatmeal",
			"comments": []
		},
		{
			"title": "Barley Pilaf",
			"comments": []
		},
		{
			"title": "Basic Custard",
			"comments": []
		},
		{
			"title": "Basic Muffins",
			"comments": []
		},
		{
			"title": "Basic Quiche",
			"comments": [
				"Instead of using the veggies I used frozen chopped spinach and I eliminated the salt.Also in place of the salt I used a tad of parmesan cheese.It was wonderful"
			]
		},
		{
			"title": "Basic Steamed Collards",
			"comments": []
		},
		{
			"title": "Bean and Rice Burritos",
			"comments": [
				"tastes great but I don't know how they came up with Total Cost: $3.22 and Serving Cost: $0.40.  An 8oz bag of cheddar cheese normally costs $2.50 and up; rarely on sale for $2.00.",
				"My family and I already make something like this except to save additional money my children make homemade tortillas with a press. It's actually not very hard or time consuming and they think it's fun. It's actually now my 11 y/o's job when we have anything with tortillas."
			]
		},
		{
			"title": "Bean Dip",
			"comments": [
				"I used black beans instead of kidney beans.  The participants loved the recipe.",
				"I tripled all the spices (chili powder, dried chopped onion, and cumin) and it was gobbled up by the elementary students I taught.  Watch out, though: if youngsters watch the preparation, they might say the dip looks gross.  When they try it, they like it"
			]
		},
		{
			"title": "Bean Enchiladas",
			"comments": [
				"Fun to make and really tasty."
			]
		},
		{
			"title": "Beets, Beans, & Greens",
			"comments": []
		},
		{
			"title": "Bell Pepper and Apple Coleslaw",
			"comments": []
		},
		{
			"title": "Bell Pepper and Potato Salad",
			"comments": []
		},
		{
			"title": "Bell Pepper and Vidalia Onion Strata with Fresh Salsa",
			"comments": []
		},
		{
			"title": "Berries with Banana Cream",
			"comments": []
		},
		{
			"title": "Berry Bread Pudding",
			"comments": [
				"Is this recipe missing the eggs and milk? I have never heard of bread pudding NOT containing milk and bread! This was one of the first recipes I looked at on the seasonal fruit and vegetable page, and was disappointed.  If this is to be a site we would promote to participants, food shelves, and other agencies, we may need someone to critic and revise the recipes!",
				"I prepared this dish for young students.  They did not care for it, but my adult audience loved it."
			]
		},
		{
			"title": "Berry Good Dessert",
			"comments": []
		},
		{
			"title": "Better Baking Mix",
			"comments": []
		},
		{
			"title": "Black Bean and Rice Salad",
			"comments": [
				"This salad was pretty awful! All my family and I could taste was the onion and lemon juice! Ewwwwww!!!",
				"The vinegar was a bit too strong; if not using rice vinegar it would be better to reduce the amount a bit.  We liked it best with lemon, but less than the amount in the recipe."
			]
		},
		{
			"title": "Black Bean and Sweet Potato Quesadillas",
			"comments": [
				"My partner and I loved how this recipe turned out!  I noticed another user mentioned odd texture from black beans and sweet potato being mashed.  I did mash the sweet potatoes with the onion, garlic, and hot pepper.  The changes I made were using 3 garlic cloves instead of 1, using a serrano chile in place of jalepeno, sauteeing the spinach, and using a little bit more cheese (about 1.5 oz per quesadilla.)  The quesadillas were served with sliced avocado, hot salsa, and sour cream on the side.  We will definitely make this again!",
				"flavor is good, but texture is not desirable. Not sure why it's necessary to mash the sweet potatoes and black beans when you can just dice and cook the potatoes and add the cooked black beans whole for much better texture."
			]
		},
		{
			"title": "Black Bean Burgers",
			"comments": []
		},
		{
			"title": "Black Bean Quesadillas",
			"comments": []
		},
		{
			"title": "Black Beans",
			"comments": [
				"A suggestion to cut down on the sodium.  Rinse the black beans by pouring the contents into a colander and rinse with cold water to remove salt before using the beans.  Also, adding brown rice as a side dish helps complete the protein intake.",
				"To accommodate a small child who does not like onions, I minced the onions, rather than chopping them.  This recipe was very easy and produced great results."
			]
		},
		{
			"title": "Blue Corn Pan Bread",
			"comments": []
		},
		{
			"title": "Blueberry Muffins",
			"comments": [
				"The muffins were a little dry.  Other then that they were good"
			]
		},
		{
			"title": "Bran Muffins",
			"comments": [
				"I used 3\\\\4 cup oil and 1\\\\4 cinnamon apple sauce it worked great and gave a little more taste to the muffins"
			]
		},
		{
			"title": "Bran Muffins II",
			"comments": []
		},
		{
			"title": "Brazilian Rice",
			"comments": []
		},
		{
			"title": "Bread in a Bag",
			"comments": [
				"This was helpful -- and a bit fun. My kids loved shaking and squeezing the bags. I added some chopped fresh basil from my windowsill. And Yum."
			]
		},
		{
			"title": "Bread Pudding with Vanilla Sauce",
			"comments": [
				"Does anyone know how much water to put in the vanilla sauce? The recipe doesn't say.",
				"This recipe can also be baked in the oven in a 9x13 pan at 350 degrees for 45 minutes."
			]
		},
		{
			"title": "Breakfast Burrito",
			"comments": []
		},
		{
			"title": "Breakfast Parfait",
			"comments": [
				"Pineapple and thawed berries need to be drained well.  Make the parfait soupy.  Otherwise it tasted great, just wasn\\\\'t as pleasing to look at.  It would have received a 5 with that modification. <br/>",
				"Use of frozen unsweetened raspberries caused complaints about sour taste from Alternative Learning Center teens."
			]
		},
		{
			"title": "Broccoli Alfredo",
			"comments": []
		},
		{
			"title": "Broccoli and Corn Bake",
			"comments": [
				"Loved this recipe because I usually have these items in the house.  Easy to make when I need something quick!",
				"I use chicken in a biscuit crackers.  Family and friends love this dish.",
				"I added some cheese to the broccoli and cheese, it gave it alittle extra kick."
			]
		},
		{
			"title": "Broccoli Baked Potatoes",
			"comments": []
		},
		{
			"title": "Broccoli Omelet",
			"comments": []
		},
		{
			"title": "Broccoli Rice Casserole",
			"comments": [
				"No flavor... Very watery! Threw it away!",
				"I added some cut up chicken and used cream of chicken soup instead of mushroom.  It was delicious!!"
			]
		},
		{
			"title": "Broiled Tomatoes and Cheese",
			"comments": []
		},
		{
			"title": "Bronco Beans",
			"comments": []
		},
		{
			"title": "Brown Rice Pilaf",
			"comments": [
				"I used half instant wild rice and half instant brown.  Also added chopped dried cherries which was wonderful.  Passed the husband test, so it's a keeper.",
				"Lovely, easy, and QUICK to assemble!"
			]
		},
		{
			"title": "Brown Rice Pilaf with Sage, Walnuts and Dried Fruit",
			"comments": [
				"It cost more than what's listed on the recipe because walnuts are so expensive right now. I made half with walnuts and half without because I had a friend over who doesn't eat nuts. It tasted just as good without the nuts, so they can be excluded and save a lot of money."
			]
		},
		{
			"title": "Bugs on a Log",
			"comments": []
		},
		{
			"title": "Bulgur Chickpea Salad",
			"comments": [
				"This recipe was really delicious! I made it for a few friends, and everyone was surprised that it tasted so good.",
				"Although the bulger is tough to find it is well worth the search!  By far the BEST USDA recipe I've used."
			]
		},
		{
			"title": "Butterfly Bite",
			"comments": []
		},
		{
			"title": "Butternut Squash with Black Beans",
			"comments": [
				"The red wine vinegar gave this a nice kick!!",
				"This was very easy to make and very filling. I am going to try it again but use balasmic vinegar and red onions instead of what the recipe called for. I also added some shredded cheese on top. This would be great to add whatever is in your cupboard. Can o",
				"excellant flavor , evan better the next day, also great color and texture."
			]
		},
		{
			"title": "Cabbage Comfort",
			"comments": [
				"This was quick and easy to prepare and very good.  The whole family liked it.  I often saute cabbage but have never added caraway seeds which changed the flavor of the dish."
			]
		},
		{
			"title": "Cabbage Salad",
			"comments": []
		},
		{
			"title": "Cabbage Stir-Fry",
			"comments": []
		},
		{
			"title": "Cafe Mocha",
			"comments": [
				"The recipe calls for regular hot cocoa mix.  There is too much sugar in commercial hot cocoa mixes.  The recipe would be improved by substituting cocoa powder and some vanilla extract to reduce the sugar yet retain the yummy flavor."
			]
		},
		{
			"title": "Candied Yams",
			"comments": []
		},
		{
			"title": "Cantaloupe Cooler",
			"comments": [
				"Ripe cantaloupe and orange juice are sweet on their own.  Why the added 2 tablespoons of sugar?  Part of healthy eating is training our taste buds to enjoy and experience the natural sugars in fruits without adding extra sugars.  I encourage you to cut out the added sugars in your recipes.",
				"I haven't made this so shouldn't be commenting I guess, but why all the added sugar? Both OJ and cantaloupe are pretty sweet (I was just eating some at lunch, it was sooo wonderful). I could see a couple tsps. but 2 tbsps? I am a dietitian and not anti-sugar altogether, but it's a good experience to taste the food without added sugar and get used to not having everything sugared-up. Just sayin.'",
				"Why add sugar? Fruit is naturally sweet - refined sugar is what we want to avoid!"
			]
		},
		{
			"title": "Caramel Sauce",
			"comments": []
		},
		{
			"title": "Caramelized Mushroom and Vidalia Onion Risotto",
			"comments": []
		},
		{
			"title": "Caribbean Bean Salad",
			"comments": []
		},
		{
			"title": "Caribbean Casserole",
			"comments": [
				"I did change out the stewed tomatoes with petite diced tomatoes and 1/2 tsp. sugar. Many of the participants say they now use this recipe as one of their regular meals."
			]
		},
		{
			"title": "Caribbean Pink Beans",
			"comments": [
				"I loved this. Wish I had added more tomato than the recipe called for."
			]
		},
		{
			"title": "Carrot Cookies",
			"comments": [
				"These never really seemed to be baked, and the honey flavor was overwhelming.",
				"We have prepared this recipe many times with different audiences.  When everyone finds out there are carrots and not any sugar in the recipe they are surprised.  In my opinion it is a great and healthy recipe."
			]
		},
		{
			"title": "Carrot Raisin Salad",
			"comments": []
		},
		{
			"title": "Carrots with Tomatoes and Macaroni",
			"comments": []
		},
		{
			"title": "Cauliflower Shells with Cheese",
			"comments": []
		},
		{
			"title": "Celery with Apricot Blue Cheese Spread",
			"comments": []
		},
		{
			"title": "Chapatis Flatbread",
			"comments": [
				"Can also be made with jiffy in a pinch and its awesome. We like to serve it with chicken alfredo.",
				"We used half all-purpose and half whole wheat flours, and everyone really liked it."
			]
		},
		{
			"title": "Cheese and Corn Chowder",
			"comments": [
				"Vegetables should be caramelized first; it adds a great deal of flavor!  We also added 1 tsp. of chicken bouillon powder.  The soup is bland otherwise."
			]
		},
		{
			"title": "Cheese Stuffed Potatoes",
			"comments": []
		},
		{
			"title": "Cheese-A-Roni Bake",
			"comments": []
		},
		{
			"title": "Chickpea Dip",
			"comments": []
		},
		{
			"title": "Chickpeas and Spinach Sauté",
			"comments": []
		},
		{
			"title": "Chili and Spice Seasoning",
			"comments": []
		},
		{
			"title": "Chili Bean Dip",
			"comments": [
				"I would reserve some, not all, of the canned bean juice to mash into the beans. Dip was crumbly and dry without it.",
				"The clients were very thrilled with this recipe, and asked for a copy"
			]
		},
		{
			"title": "Chili Popcorn",
			"comments": [
				"Used in several youth classes during the school year. Most kids preffered this recipe to the cinnamon popcorn."
			]
		},
		{
			"title": "Chilled Cantaloupe Soup",
			"comments": [
				"A friend sent me this recipe because both of us are on a low-fat, low sodium diets. It was simply delicious. I made it the night before and poured it into a refrigerated container and took it to work with me.  I sipped on it all thru the day - it was a cool, refreshing drink that kept me cool. I also had some before bedtime to tide me over till morning.  It was better than eating something else."
			]
		},
		{
			"title": "Chocolate Chip Yogurt Cookies",
			"comments": [
				"I think I would add 1 egg to this recipe. That would give them some oomph.",
				"I really wanted to like these, but they never seemed baked. They need something to give them oomph, but I don't know what. If you have suggestions, please write a review because I would like to serve them again, but with more flavor.",
				"I've noticed that some people are complaining about the cost break down. The cost of each ingredient is broken down by ounce and the total purchase price is based on buy larger quantities which lowers the total cost."
			]
		},
		{
			"title": "Chocolate Peanut Butter Frozen Bars",
			"comments": [
				"graham crackers were soft, once frozen, bars were hard to cut."
			]
		},
		{
			"title": "Chunky Garbanzo Bean Dip",
			"comments": []
		},
		{
			"title": "Cinnamon Sugared Pumpkin Pecan Muffins",
			"comments": [
				"These were made in conjunction with a Pumpkin Harvest of the Month activity.  <br/> <br/>All the participants loved them and they really liked the nuts on top. Putting the sugar/cinnamon mixture on top of the muffins made them crunchy and delicious. The muffins were very moist and fluffy. The cooking time was spot on."
			]
		},
		{
			"title": "Cinnamon Vanilla Granola",
			"comments": []
		},
		{
			"title": "Citrus Salad",
			"comments": [
				"It had no good flavor at all and I would never serve this to anyone again.  It made my nutrition class not as successful as it could have been"
			]
		},
		{
			"title": "Citrus Vegetables",
			"comments": []
		},
		{
			"title": "Classic Honey Flan",
			"comments": []
		},
		{
			"title": "Classic Macaroni and Cheese",
			"comments": [
				"Great start -- experiment with herbs, leftover ham or chicken, tomatoes.",
				"I would omit the onions. I had recipents comment the onion was not a good combination taste with the mac and cheese."
			]
		},
		{
			"title": "Cobb Salad with Pears",
			"comments": []
		},
		{
			"title": "Coffee Cooler",
			"comments": []
		},
		{
			"title": "Colorful Quesadillas",
			"comments": [
				"Absolutely divine with no aterations made.",
				"I really liked the colorful quesadillas. They tasted great and were easy to make. It was a fun and easy way to add some vegetables and extra flavor to one of our family stand-bys of quesadillas.",
				"I also added shredded chicken breast, and to make it easier to spread I run it through a food processor."
			]
		},
		{
			"title": "Confetti Bean Salsa",
			"comments": [
				"I tried it, and my family loved it. So  I want to make it every week.",
				"This recipe is very attractive.  I used black beans and fresh chopped cilantro."
			]
		},
		{
			"title": "Confetti Grain Salad",
			"comments": []
		},
		{
			"title": "Confetti Slaw",
			"comments": [
				"Would add peanuts just before serving. Suggested to add some low-fat mayo and gave milder taste."
			]
		},
		{
			"title": "Cooked Beans",
			"comments": [
				"This was really helpful!! Thank you, MyPlate!"
			]
		},
		{
			"title": "Cookie Cutter Appetizers",
			"comments": []
		},
		{
			"title": "Corn and Bean Medley",
			"comments": []
		},
		{
			"title": "Corn and Cucumber Salad",
			"comments": [
				"Only I make some changes in the ingredientes to add more color and  taste to the recipe the can of corn I change for a can of mexican corn for more color and add fresh cilantro for more taste."
			]
		},
		{
			"title": "Corn and Green Chili Salad",
			"comments": [
				"I love the fresh cilantro in it. <a href=\"http://www.wikistarbio.com\">wiki</a&gt;",
				"you can also use a whole jar or portion of the green chilies with a whole can of diced tomatoes",
				"This recipe is delicious! I love the fresh cilantro in it!"
			]
		},
		{
			"title": "Corn and Pepper Cups",
			"comments": []
		},
		{
			"title": "Corn Bread",
			"comments": []
		},
		{
			"title": "Corn Casserole",
			"comments": []
		},
		{
			"title": "Corn Salad",
			"comments": [
				"I substituted cucumber for the celery to make it even more affordable and the flavors were great together! <br/> <br/>Many positive comments from the clients, especially from men.",
				"Participants loved this recipe.  They stated before preparing it that the ingredients did not seem to mix.  After they ate it, they loved it."
			]
		},
		{
			"title": "Corn Salad II",
			"comments": []
		},
		{
			"title": "Corn Toasties",
			"comments": []
		},
		{
			"title": "Corn Tortillas",
			"comments": []
		},
		{
			"title": "Cornmeal Pancakes",
			"comments": []
		},
		{
			"title": "Country Style Potato Salad",
			"comments": []
		},
		{
			"title": "Couscous with Peas and Onions",
			"comments": []
		},
		{
			"title": "Cran-Apple Crisp",
			"comments": [
				"to reply to the comment of margarine... it is cheaper and a lot of people have to make decisions to feed their family. I receive snap and have to make these decisions its my only way of buying groceries... i am disabled i am not able to work dr's orders",
				"Great desert for the Fall, But...MARGARINE? Surely it's not on the SNAP food list! All those trans fats! Use real unsalted BUTTER or some good coconut oil. Or in a pinch some safflower oil.  And try thin skinned apples like golden delicious to keep the fiber.  Scrub well first if not organic or from your own tree.",
				"Although leaving the peel on gave added nutrition it did not taste good or feel good to the palate.  I would take off the peel next time and add flour to the topping."
			]
		},
		{
			"title": "Cranberry Nut Bread",
			"comments": []
		},
		{
			"title": "Cranberry Pumpkin Muffins",
			"comments": [
				"I love these muffins! I did make a few modifications: <br/>1. Used 1/2 tsp dry ginger + 1/4 tsp allspice instead of 3/4 tsp allspice  <br/>2. Added 2 Tbsp more oil <br/>3. Used frozen cherries instead of cranberries.  <br/>Yum!",
				"Muffins came out moist and didn't overly taste like pumpkin. Keep in mind that these muffins don't rise much, so fill your muffin trays all the way up. I made these muffins twice, and both times they needed just 15 minutes to bake.",
				"also baked as bars <br/>"
			]
		},
		{
			"title": "Cream of Broccoli Soup II",
			"comments": []
		},
		{
			"title": "Creamy Dill Dip",
			"comments": [
				"A little bland.  Needs something, but what?"
			]
		},
		{
			"title": "Creamy Italian Herb Dressing",
			"comments": [
				"i made it every 3 day so do not run out"
			]
		},
		{
			"title": "Creamy Peanut Dip",
			"comments": [
				"What a surprisingly tasty dip! I made one as the recipe dictated, and another one with chili powder. Ooooh that bumped it UP!"
			]
		},
		{
			"title": "Creamy Vegetable Dip",
			"comments": []
		},
		{
			"title": "Creole Beans",
			"comments": []
		},
		{
			"title": "Crispy Oven Baked Fries",
			"comments": []
		},
		{
			"title": "Crock Pot Vegetable Lentil Stew",
			"comments": [
				"First time preparing this dish. Cooked all ingredients in slow cooker for 8 hrs on low and lentils were still hard! Very disappointed. Either need to cook on high , or increase hours. Did not soak beans overnight, maybe I need to do that next time.....or use red lentils, which is my lentil of choice, much more tender.!"
			]
		},
		{
			"title": "Crunchy Berry Parfait",
			"comments": []
		},
		{
			"title": "Crunchy Vegetable Wraps",
			"comments": [
				"Takes a lot of prep time"
			]
		},
		{
			"title": "Crustless Pumpkin Pie",
			"comments": []
		},
		{
			"title": "Crusty Rice with Tofu and Vegetables",
			"comments": []
		},
		{
			"title": "Cucumber Blueberry Salad",
			"comments": []
		},
		{
			"title": "Cucumber Salad",
			"comments": []
		},
		{
			"title": "Cucumber Salad with Tomatoes",
			"comments": [
				"Ijhave been using this recipe for years and it always a crowd pleaser!",
				"Great taste, easy to make. We are using the recipe at our Farmers Markets and in our Cook It Quick newsletter.",
				"A light an refreshing salad.  Delicious!"
			]
		},
		{
			"title": "Cucumber Yogurt Dip",
			"comments": [
				"I also set the grated cucumber aside for a bit to drain some of the liquid off, this prevents the dip from becoming diluted. I also prefer the plain yogurt and sour cream combination.",
				"I changed the recipe to 1 cup plain yogurt and 1 cup non-fat sour cream.  As written, I thought the yogurt flavor was too overpowering.  Also, I doubled the garlic."
			]
		},
		{
			"title": "Cucumber Yogurt Dip II",
			"comments": []
		},
		{
			"title": "Curried Chickpea Salad  ",
			"comments": []
		},
		{
			"title": "Curried Potatoes with Red Lentils",
			"comments": []
		},
		{
			"title": "Curried Squash Stew",
			"comments": []
		},
		{
			"title": "Curry Dip",
			"comments": [
				"Very good!"
			]
		},
		{
			"title": "Curry Vegetable Dip",
			"comments": []
		},
		{
			"title": "Curtido Salvadoreno (Cabbage Salad)",
			"comments": [
				"This recipe is not only to be serve with pupusas also can be serve with yuca frita, enpanadas de carne or over a fresh hand made corn tortilla top with the curtido and a salsa casera."
			]
		},
		{
			"title": "Dave’s Herb-Stuffed Mushrooms",
			"comments": []
		},
		{
			"title": "Deep Dish Apple Cranberry Pie",
			"comments": []
		},
		{
			"title": "Delicious Greens",
			"comments": []
		},
		{
			"title": "Delicious Lentil Stew",
			"comments": []
		},
		{
			"title": "Delicious Oven French Fries",
			"comments": []
		},
		{
			"title": "Deviled Eggs",
			"comments": []
		},
		{
			"title": "Drop Biscuits (from Better Baking Mix)",
			"comments": []
		},
		{
			"title": "Dutch Apple Yogurt Dessert",
			"comments": [
				"I made this in a snack demo for a few groups of girls in a mentoring program. I added chopped apples for texture and omitted the sugar because there was no reason to add more sugar as it was already sweet enough. I used Greek yogurt and a generic brand of Grape Nuts cereal called Nutty Nuggets and they could not get enough."
			]
		},
		{
			"title": "Dutch Green Beans",
			"comments": []
		},
		{
			"title": "Eagle Nest",
			"comments": []
		},
		{
			"title": "Easiest Banana Ice Cream",
			"comments": [
				"This was quick to make and had a nice consistency. I think it might need some salt and vanilla for more flavor."
			]
		},
		{
			"title": "Easy Eggplant Stir Fry",
			"comments": []
		},
		{
			"title": "Easy Fruit Salad",
			"comments": [
				"This was so good, quick, and easy. Much more flavorful than just eating the can of fruit cocktail. The pina colada yogurt is a nice way to hold it together a little and add some more flavor.",
				"This was delicious made with lemon yogurt, an option given on the FDPIR oranges fact sheet version of the recipe.",
				"The Pina Colada yogurt is an excellent addition to this fruit salad. This salad is delicious as a filling snack, dessert, side & everything in between! Plus, no cooking required!"
			]
		},
		{
			"title": "Easy Greek Salad",
			"comments": [
				"Participants in the EFNEP program loved this salad."
			]
		},
		{
			"title": "Easy Mango Salsa",
			"comments": []
		},
		{
			"title": "Easy Marinara Sauce",
			"comments": []
		},
		{
			"title": "Easy Red Beans and Rice",
			"comments": []
		},
		{
			"title": "Easy Rice Pudding",
			"comments": [
				"This recipes tastes great hot or cold.  I made this for our local food pantry recipients and a couple of the people said it tasted just like a recipe they had tasted as children.  Even the skeptics were pleasantly surprised by the taste.  It was a warm day, so I served it cold.",
				"It tasted really good. I used leftover brown rice so I added a little more sugar. I will definitely make this again - it is such a yummy, filling dish warm or cold."
			]
		},
		{
			"title": "Easy Stuffed Pasta Shells",
			"comments": []
		},
		{
			"title": "Easy-As-A-Mix Pizza (from Better Baking Mix)",
			"comments": []
		},
		{
			"title": "Eating Smart Seasoning Mix",
			"comments": []
		},
		{
			"title": "Egg Salad",
			"comments": [
				"Suggest to remove the salt from ingredients since the other ingredients already have salt in them."
			]
		},
		{
			"title": "Eggplant and Pepper Dip",
			"comments": [
				"Recipe was well received even though many of the clients have never eaten eggplant.  Nice job!",
				"Served on crackers at Farmer's Market program. Easy to fix, and transport for serving. This was also great added to cooked macaroni and sprinkled with parm. cheese.",
				"Thought fresh herbs would taste better, but we actually preferred it with dried!"
			]
		},
		{
			"title": "Eggs Foo Young",
			"comments": []
		},
		{
			"title": "Eggs over Kale and Sweet Potato Grits",
			"comments": []
		},
		{
			"title": "Elaine’s Green-Mash Potatoes",
			"comments": []
		},
		{
			"title": "Enchilada Bake",
			"comments": [
				"My kids (12 and 14) as well as my husband and myself loved this!"
			]
		},
		{
			"title": "English Muffin Veggie Pizza",
			"comments": [
				"I used this recipe as inspiration when working with my son's co-op preschool class.  We do cooking activities once a week and we set up a make-your-own  pizza station which was a huge hit with our group of 4 and 5 year olds.  In addition to the toppings listed, we had a bowl of olives, chopped ham, pineapple, and green peppers.  It was fun to see kids varying opinions about things like black olives and green peppers- some of them loved them, some said \"yuck!\" at first but then were willing to try (and even liked!) these foods once their friends ate them.  We used whole wheat English Muffins, and also baked in the oven (about 10 minutes at 400) vs. a toaster as we do not have toaster ovens at the school.  A large (commercial sized) sheet pan worked perfectly for about 18 pizzas.  Two household sized cookie sheets would probably work for the same amount.  We put them on parchment paper so that we could write names by each pizza so each student could be sure to get the one they made.  Lots of positive comments made and several parents and students mentioned that they were definitely going to make these at home."
			]
		},
		{
			"title": "Fabulous Fruit Muffins",
			"comments": [
				"I made these muffins today and they were great! I used fresh strawberries and sprinkled some granulated sugar over the top of each muffin before baking them.",
				"We used fresh pineapple, and everyone liked them very much."
			]
		},
		{
			"title": "Falafel with Yogurt Sandwich",
			"comments": []
		},
		{
			"title": "Fall Veggie Casserole",
			"comments": [
				"WOULD USE ONE CAN DICED TOMATOES"
			]
		},
		{
			"title": "Fantastic French Toast",
			"comments": [
				"Students used this recipe to make Big Pine French Toast by cutting French Toast diagonally to build a tree, then sprinkling with powdered sugar and green decorator sugar crystals on top. Used a slice of orange for the sun and Bosc pear slices for the tree trunk, then use fresh parsley around the base. Looks beautiful!"
			]
		},
		{
			"title": "Farmers Market Gazpacho",
			"comments": [
				"I tried this recipe recently using fairly average sized peppers and tomatoes and found that the yeild listed is very conservative.  I think it could easily feed 6 people- and that's with pretty large servings.    It's a tasty, refreshing cold soup that I'd recommend serving with a hearty bread.  Because the soup is pretty light and low in Calories, it also would go nicely with a fruit cobbler for dessert :)"
			]
		},
		{
			"title": "Farmers Market Salsa",
			"comments": [
				"Amazing salsa!! I served it with baked tortilla chips and everyone loved it. Will certainly make again in the summer!",
				"I used this recipe with low-income seniors in subsidized housing. They thought it was something they could do on their own and are willing to make for themselves. I did not have time to dice ingredients so I used canned ingredients with no added salt (dice tomatoes w/ onion, green pepper, basil, and oregano) and it was a hit! They participate in the brown bag program and that day they received canned beans, which was perfect timing!",
				"Fresh tasting, easy to make"
			]
		},
		{
			"title": "Fat-Free Apple Crumb Dessert",
			"comments": []
		},
		{
			"title": "Festive Microwave Baked Apples",
			"comments": []
		},
		{
			"title": "Fiesta Hummus",
			"comments": []
		},
		{
			"title": "Fiesta Mix",
			"comments": [
				"Great recipe.  Try adding a few dark chocolate m&m's."
			]
		},
		{
			"title": "Fiesta Rice Salad",
			"comments": []
		},
		{
			"title": "Five Happiness Fried Noodles",
			"comments": [
				"I found all ingredients at my local SuperCenter."
			]
		},
		{
			"title": "Flavorful Fried Rice",
			"comments": [
				"Pretty good dish. I added some 5 spice seasoning and some ground ginger.",
				"A little bland, I added 1 tsp ground ginger and 1 tsp of garlic and increased the soy sauce to 4 tbs."
			]
		},
		{
			"title": "Flour Tortillas",
			"comments": [
				"Even tho we make our own bread, I was a little reluctant to try my hand at tortillas; but I'm glad I did.  For uniform size/shaping I roll the dough & then slice, using a small plate as a guide <br/> <br/> <br/>The tortilla ingredients are in my cabinet 99% of the time & are inexpensive to prepare.  They can be used as sandwich wraps, quesadillas, or made crispy for a chip like snack & you can add spices for flavor variability <br/> <br/> <br/>For me the challenging part was learning how to roll them nice & flat, and thin enough.  The learning process was well worth the effort, as I am now able to make something myself that I was previously buying at the store <br/> <br/> <br/>The tortilla ingredients are in my cabinet 99% of the time & are inexpensive to prepare.  They can be used as sandwich wraps, quesadillas, or made crispy for a chip like snack & you can add spices for flavor variability <br/> <br/> <br/>For me the challenging part was learning how to roll them nice & flat, & thin enough.  The learning process was well worth the effort, as I am now able to make something myself that I was previously buying at the store"
			]
		},
		{
			"title": "Food Group Funny Face",
			"comments": [
				"my kids loved this!"
			]
		},
		{
			"title": "French Salad Dressing",
			"comments": []
		},
		{
			"title": "Fresh Fruit with Cinnamon Yogurt Dip",
			"comments": [
				"I made this for the kids I teach nutrition to. They loved it. Some even asked for more dip after they ate all their fruit. We had apples, pears, bananas, and raspberries. Out of 32 kids, 2 didn't eat it.",
				"GREAT Dip!!!!! very easy to make.  had with strawberries, apples and cantalope.  Everyone LOVED it.  It will now be one of the staples of our recipes.",
				"This recipe works well for people who don't like the taste of yogurt on its own. It's just as easy to use canned fruit instead of fresh fruit as well."
			]
		},
		{
			"title": "Fresh Salsa",
			"comments": [
				"Watch out: the lime can be overpowering.  Some people especially liked the recipe for its lime flavor, though.",
				"Basic recipe, and inexpensive.  Great addition to other hispanic dishes such as rice or beans or the mexican pizza recipe on this site."
			]
		},
		{
			"title": "Fresh Tomato Salsa",
			"comments": []
		},
		{
			"title": "Fresh Tomato Sauce",
			"comments": []
		},
		{
			"title": "Frosted Cake",
			"comments": []
		},
		{
			"title": "Frozen Banana Pops",
			"comments": [
				"Cut banana in half Length wise. <br/>Do not peel yet -  insert craft stick into center of cut surface. Watch the angle, not too close to the edges. <br/>NOW peel the banana, it is less likely to split apart.",
				"I love that kids can make this recipe themselves. Very simple to do and affordable. Makes for a healthy frozen snack for summer."
			]
		},
		{
			"title": "Frozen Fruit Cups",
			"comments": [
				"Most people do not have 18 cup baking tins.  Most people have 12 cup pans.  We plan to use the recipe but will revise for 12 or 24 servings"
			]
		},
		{
			"title": "Frozen Fruit Pops",
			"comments": []
		},
		{
			"title": "Fruit & Feta Salad",
			"comments": []
		},
		{
			"title": "Fruit and Peanut Butter Dip",
			"comments": []
		},
		{
			"title": "Fruit and Yogurt Breakfast Shake",
			"comments": [
				"I made this recipe with kids and they loved it."
			]
		},
		{
			"title": "Fruit Cole Slaw",
			"comments": []
		},
		{
			"title": "Fruit Compote",
			"comments": [
				"There is too much liquid for the amount of cornstarch, therefore, it would not thicken."
			]
		},
		{
			"title": "Fruit Dip",
			"comments": [
				"I teach cooking classes with teenagers and this is one of their favorite dip recipes to make! It also goes really well with lemon juice if you don't have lime.",
				"I work out in the community. This dip was a hit everywhere I served it. I also used canned fruit to save money.",
				"A great way to dress up sliced fruit.  I made this for a party last night and had some leftover, so I put a spoonful of this in my blender with some leftover fruit, ice and a little non-fat milk for a tasty smoothie! Delicious!"
			]
		},
		{
			"title": "Fruit Dippers",
			"comments": []
		},
		{
			"title": "Fruit Juice Slush",
			"comments": [
				"sounds delicious and I can't wait to try it."
			]
		},
		{
			"title": "Fruit Kabob",
			"comments": []
		},
		{
			"title": "Fruit Kabobs with Yogurt Dip",
			"comments": [
				"These are so easy to make and kids love putting them together in their own special way!",
				"Children can assemble kabobs themselves.  Can serve without yogurt."
			]
		},
		{
			"title": "Fruit Milk Shakes",
			"comments": []
		},
		{
			"title": "Fruit Pizza",
			"comments": [
				"I made it in a 9x13 pan using a banana and 3 kiwi. I also added a little glaze of 1/4 cup melted orange marmalade. It was wonderful."
			]
		},
		{
			"title": "Fruit Pizza To Go",
			"comments": []
		},
		{
			"title": "Fruit Salad with Jicama",
			"comments": [
				"Wonderful and refreshing...of course many of the fruits are best purchased when in season for best prices and ripeness.  Excellent summer salad."
			]
		},
		{
			"title": "Fruit Salsa",
			"comments": [
				"I shared this recipe while teaching \"Kids in the Kitchen\" with a middle school culinary class. I almost didn't use it, because I thought it was a strange combination of fruit. The lemon juice and spices made it burst with flavor and the multi-textured fruits were great together. The students also prepared cinnamon chips from whole wheat tortillas and they were a tasty dipper for this delicious Fruit Salsa. I plan on using this recipe at home. I loved it!"
			]
		},
		{
			"title": "Fruit Slush",
			"comments": [
				"I tested this recipe with my family.  It was easy to make and we all loved it.  I will use with SNAP recipients in the future."
			]
		},
		{
			"title": "Fruit Smoothie",
			"comments": [
				"Very easy and cheap to make.  Try frozen yogurt instead.",
				"I would recommend using an overripe banana (much sweeter), plain yogurt vs vanilla (less sugar) and cut the juice and add extra fruit (more fiber) to make this an even healthier smoothie.",
				"I've made these smoothies by using all the same ingredients except I use frozen yogurt instead of regular yogurt.  It taste more like a shake!  Delicious!!"
			]
		},
		{
			"title": "Fruit Smoothie II",
			"comments": []
		},
		{
			"title": "Fruit Snake",
			"comments": []
		},
		{
			"title": "Fruit Yogurt Parfait",
			"comments": []
		},
		{
			"title": "Fruit Yogurt Pops",
			"comments": []
		},
		{
			"title": "Fruity Homemade Oatmeal",
			"comments": []
		},
		{
			"title": "Fruity Thai Pita Pockets",
			"comments": []
		},
		{
			"title": "Fudgy Fruit",
			"comments": []
		},
		{
			"title": "Garden Cannellini Bean Salad",
			"comments": []
		},
		{
			"title": "Garden Orchard Salad",
			"comments": []
		},
		{
			"title": "Garden Pasta Salad",
			"comments": []
		},
		{
			"title": "Garden Waldorf Salad",
			"comments": []
		},
		{
			"title": "Garlic Bok Choy",
			"comments": []
		},
		{
			"title": "Gazpacho",
			"comments": []
		},
		{
			"title": "Gazpacho Soup",
			"comments": []
		},
		{
			"title": "Ginger Bread Mix",
			"comments": []
		},
		{
			"title": "Ginger Orange Muffins",
			"comments": []
		},
		{
			"title": "Glazed Carrots",
			"comments": []
		},
		{
			"title": "Grandma's Stuffing",
			"comments": []
		},
		{
			"title": "Granola Bars",
			"comments": [
				"The bars are rather basic, with only a mild flavor. A great base to build on if you want to make a more flavorful version. Can't beat the price per bar though.",
				"Is this supposed to make and 8x8, a 9x9, an 8x12, a 9x13 pan?  Jelly Roll Pan?  I'm presuming the pan must be greased or sprayed to prevent sticking.",
				"I tested this recipe with some friends who were wanting me to make them granola bars. It was very easy to follow (the recipe is accurate) and tasted good. My only other comment is that the bars are very peanutty...this is not a problem in my book, I quite liked it, just don't be expecting Nature Valley granola bars."
			]
		},
		{
			"title": "Grape and Cashew Salad Sandwich",
			"comments": []
		},
		{
			"title": "Grapefruit Spinach Salad ",
			"comments": []
		},
		{
			"title": "Green Bean and Mushroom Medley",
			"comments": []
		},
		{
			"title": "Green Bean and Rice Casserole",
			"comments": []
		},
		{
			"title": "Green Bean Saute",
			"comments": [
				"This is a nice way to dress up canned green beans."
			]
		},
		{
			"title": "Green Beans and New Potatoes",
			"comments": []
		},
		{
			"title": "Green Beans with Tomatoes and Basil",
			"comments": []
		},
		{
			"title": "Grilled Cheese with Peaches",
			"comments": []
		},
		{
			"title": "Grilled Fruit",
			"comments": []
		},
		{
			"title": "Grilled Vegetable Packets",
			"comments": []
		},
		{
			"title": "Grilled Vegetables",
			"comments": []
		},
		{
			"title": "Harvest Vegetable Salad",
			"comments": []
		},
		{
			"title": "Hearty Mashed Potatoes",
			"comments": [
				"Why peal potatoes when nutrients are in the skin? Also to get the most nutrients for your money use dried beans not canned."
			]
		},
		{
			"title": "Hearty Mexican Soup",
			"comments": []
		},
		{
			"title": "Hearty Vegetable Salad with Herb Dressing",
			"comments": []
		},
		{
			"title": "Heavenly Deviled Eggs",
			"comments": []
		},
		{
			"title": "Herb Potato Salad",
			"comments": []
		},
		{
			"title": "Herb Spinach Bake",
			"comments": []
		},
		{
			"title": "Herbed Dip",
			"comments": [
				"If possible try making with fresh herbs, which are easy to grow in warm months.",
				"The flavor and consistency were off.  It was bland and chalky."
			]
		},
		{
			"title": "Herbed Garden Pizza",
			"comments": []
		},
		{
			"title": "Herbed Spinach Quiche Portabella Caps",
			"comments": []
		},
		{
			"title": "Herbed Vegetables",
			"comments": [
				"Frozen veggies cost the same as canned."
			]
		},
		{
			"title": "Hiding Rabbits",
			"comments": []
		},
		{
			"title": "Homemade Cranberry Sauce",
			"comments": []
		},
		{
			"title": "Homemade Mashed Potatoes",
			"comments": []
		},
		{
			"title": "Homemade Pizza Crust",
			"comments": []
		},
		{
			"title": "Homestyle Biscuits",
			"comments": [
				"This recipe is great as biscuits. I've served them with soup and also with sausage gravy. They make great pigs in a blanket. (Just wrap one biscuit of dough around a half of a wiener. Bake as usual.)This recipe can also be used for caramel nut pull-aparts. 1/4 cup melted margarine. 1/3 cup brown sugar. 1/4 cup chopped nuts- optional. drop wads of dough onto ingredients in a 9 round pan. Bake as usual. Invert on a plate to serve."
			]
		},
		{
			"title": "Honey Milk Balls",
			"comments": [
				"I made this recipie but I used all the ingedients except cereal, I added instant oatmeal yummy! and healthy",
				"This was a nice snack alternative for my 2 year old.",
				"Participants loved the Peanut butter flavor and the ease of the recipe, very kid friendly and great for those non-cooks!"
			]
		},
		{
			"title": "Honey Mustard Dressing",
			"comments": []
		},
		{
			"title": "Honey of a Pumpkin Bar",
			"comments": [
				"I didn't have any dry milk so I omitted it and the orange peel.  It still tasted YUMMY and moist!",
				"Used self rising flour for a more cake-like product, but everyone loved the moistness and the extra tang of the orange juice and honey.  Several said although they don't care for pumpkin pie, they would make this recipe for the holidays"
			]
		},
		{
			"title": "Hot 'N Spicy Seasoning",
			"comments": []
		},
		{
			"title": "Hot Cornmeal Cereal",
			"comments": [
				"In the southern US this is the basic recipe for grits though usually some fat is added. Butter or lard are traditional at an amount of about 4 tbs for the posted recipe."
			]
		},
		{
			"title": "Huevos Rancheros with Fresh Salsa",
			"comments": []
		},
		{
			"title": "Hummus",
			"comments": [
				"Simple recipe that allows you to add or subtract. I doubled the amount of garlic and squeezed in a lot more lemon. Our household eats more garlic and lemons/ lemon juice than most people."
			]
		},
		{
			"title": "Indian Vegetable and Rice Skillet Meal",
			"comments": [
				"Loved the turmeric in this dish. It brought out true Indian flavors that reminded me of home. Plus, turmeric is so good for you!"
			]
		},
		{
			"title": "Instant Chocolate Mousse",
			"comments": [
				"My suggestion is to only put in a 1/2 pack of the silken tofu, rather than 3/4, and use extra-firm silken tofu.  Also sitting it in the freezer for 30-45 minutes (depending on how cold your freezer is) makes it like an ice cream dessert!"
			]
		},
		{
			"title": "Italian Bean Patties",
			"comments": [
				"You may want to add 1/4 cup of water or bean liquid to the mixture for more moisture. The crunchy crust is awesome. Fry three minutes on each side (don't flip them early). These were also good reheated in the microwave, very soft and meat-like. I added some pasta sauce and a little shredded cheese on top. I tested these at home as a possible SNAP-Ed recipe.",
				"I'm a SNAP consumer.  This recipe is staple fare in my house.  I just use more oil frying the patties.  I also add scallions/green onions, & thawed frozen chopped spinach. Delectable!!!",
				"Patties were very dry.  I even added an extra egg. Used dried beans I had soaked and cooked.  Canned beans might be better?  Also used black beans, might suggest great nothern."
			]
		},
		{
			"title": "Italian Bean Soup",
			"comments": [
				"Easy to prepare; Good to eat any time!",
				"I brought this soup to book group, everybody loved it. Some called me later and asked for the receipe and I referred them to your website!"
			]
		},
		{
			"title": "Italian Broccoli and Pasta",
			"comments": [
				"It was quick and easy to make."
			]
		},
		{
			"title": "Italian Pasta Salad",
			"comments": [
				"Recipe was made using whole wheat rotini pasta. SNAP recipients questioned how it was possible to make this for the low cost shown on recipe."
			]
		},
		{
			"title": "Italian Style Vegetables",
			"comments": []
		},
		{
			"title": "Italian Vegetables",
			"comments": []
		},
		{
			"title": "Ivory Coast Bananas with Caramel Sauce",
			"comments": [
				"this recipes gets four stars it is so easy to do and it taste great. we were not sure about baking the bananas with the skin on but it worked well. you don't want to bake for more than the 8 minutes just like the recipe calls for."
			]
		},
		{
			"title": "Jiffy Oatmeal Crunch",
			"comments": [
				"Doesn't hold together well but tastes fantastic!!",
				"This recipe is so easy, fast and delicious....I can't stop making it!",
				"We liked this recipe better than other granola type recipes I tried. I will try making it with chocolate chips next time."
			]
		},
		{
			"title": "Julia’s Sauteed & Steamed Collards",
			"comments": []
		},
		{
			"title": "Julie’s Cranberry Chutney",
			"comments": []
		},
		{
			"title": "Kale and Cranberry Stir-Fry",
			"comments": []
		},
		{
			"title": "Kale Chips",
			"comments": [
				"I like to take oil based salad dressings and brush them on for flavor.  Tomato basil is my favorite!",
				"I baked these for 10 minutes at 400 degrees.  I seasoned with a little salt and some garlic powder.  Everyone loved them and my mother-in-law asked for the recipe!",
				"I've made kale chips many times. <br/>I bake at 425 for 5-10 minutes, checking every two minutes, sometimes rearranging the leaves on baking trays. They can burn quickly be watchful. Tip - keep oven light on! <br/>Enjoy! <br/>"
			]
		},
		{
			"title": "Kale with Nuts and Raisins",
			"comments": [
				"I Tried Dried Cranberries with this salad instead of the raisins it made it even better.",
				"I Tried Dried Cranberries with this salad instead of the raisins it made it even better."
			]
		},
		{
			"title": "Layered Black Bean Dip",
			"comments": [
				"My family loves this simple recipe."
			]
		},
		{
			"title": "Leaf Finger Salad",
			"comments": []
		},
		{
			"title": "Leafy Tofu",
			"comments": [
				"Delicious and so easy."
			]
		},
		{
			"title": "Lemon Dill Brussels Sprouts",
			"comments": []
		},
		{
			"title": "Lemon Spinach",
			"comments": []
		},
		{
			"title": "Lemonade",
			"comments": []
		},
		{
			"title": "Lentil Barley Soup",
			"comments": []
		},
		{
			"title": "Lentil Stew",
			"comments": [
				"The flavor of the ingredients was okay, but required twice as much chili powder and a teaspoon (at least) of cayenne pepper to give it a little punch. Also, you will likely need more water than called for if you want the lentils to cook down a bit. The twenty minutes was not enough, probably due to the early addition of the tomatoes. This recipe has potential, but be ready to mess with the ingredients a bit."
			]
		},
		{
			"title": "Lentil Tacos",
			"comments": [
				"When I made this recipe a second time, I took out the spices and used Taco Seasoning Mix. We added fresh lettuce and tomatoes, as well as some shredded cheddar cheese. Leftover lentils were used in a version of a taco salad."
			]
		},
		{
			"title": "Lentil Vegetable Salad",
			"comments": []
		},
		{
			"title": "Lentil Vegetable Soup",
			"comments": [
				"I increased the amount of onion and celery and also added carrots to make the soup more filling without adding too many more calories. Great in cool/cold weather!"
			]
		},
		{
			"title": "Light as a Feather Whole Wheat Pancakes",
			"comments": []
		},
		{
			"title": "Lisa's Famous Dessert",
			"comments": []
		},
		{
			"title": "Lite Fried Okra",
			"comments": [
				"Fast and simple. I added a chopped-up jalapeno because I'm that kind of person!"
			]
		},
		{
			"title": "Lite Italian Dressing",
			"comments": []
		},
		{
			"title": "Lo's Blueberry Coffee Cake",
			"comments": [
				"This was delicious. I used thawed frozen blueberries. Great recipe to make at night for the next morning.",
				"I made this dessert using gluten free flour and it was absolutely delicious.",
				"Not really problems with the recipe, but I used frozen blueberries and should have thawed them first, as this of course, made the batter very COLD, so the top baked quickly, and the middle was raw!   <br/> <br/>Also suggest covering the pan with foil while baking"
			]
		},
		{
			"title": "Louisiana Green Beans",
			"comments": []
		},
		{
			"title": "Low Calorie Dressing",
			"comments": [
				"I am on a diet will work perfect kiddos love it. I have a 3 year old and a 8 months year old she won't eat it though."
			]
		},
		{
			"title": "Low Fat Creamy Dressing",
			"comments": []
		},
		{
			"title": "Low Fat Ranch Dip",
			"comments": []
		},
		{
			"title": "Mac and Beans Medley",
			"comments": []
		},
		{
			"title": "Macaroni & Cheese with Broccoli",
			"comments": []
		},
		{
			"title": "Magic Crust Quiche",
			"comments": []
		},
		{
			"title": "Magical Fruit Salad",
			"comments": [
				"I mixed the milk and pudding together in a separate bowl and then added this mixture to the fruit. <br/> <br/>I brought this to our local food pantry.  Kids thought it tasted like a smoothie with fruit in it!",
				"I lightened this up by using light mayo and light sour cream. I also used sugar free cheesecake flavored pudding. It was beyond awesome and I will definitely make this for parties again!",
				"We tried both regular and sugar-free vanilla puddings and we actually liked the sugar free pudding better."
			]
		},
		{
			"title": "Main Dish Salad",
			"comments": []
		},
		{
			"title": "Mango Berry Rotini Salad",
			"comments": []
		},
		{
			"title": "Mango Cucumber Soup",
			"comments": []
		},
		{
			"title": "Mango Salsa",
			"comments": []
		},
		{
			"title": "Mango Shake",
			"comments": [
				"This should not be described as a \"mango shake!\" It has more grams of banana in it than the 4 tbsp of mango juice!  Call it what it is: a Banana-Mango Smoothie."
			]
		},
		{
			"title": "Maple Sweet Potatoes",
			"comments": []
		},
		{
			"title": "Marinated Three-Bean Salad",
			"comments": [
				"I was told by so many people that they made this recipe for themselves after I gave them a sample. Very easy to make"
			]
		},
		{
			"title": "Mashed Sweet Potatoes",
			"comments": []
		},
		{
			"title": "Masur Dal (Red Lentils with Onion)",
			"comments": []
		},
		{
			"title": "Matzo Meal Kugel (Pudding)",
			"comments": []
		},
		{
			"title": "Mediterranean Roasted Eggplant with Tomato Sauce",
			"comments": []
		},
		{
			"title": "Melon Salsa",
			"comments": []
		},
		{
			"title": "Microwave Baked Apple",
			"comments": []
		},
		{
			"title": "Microwave Baked Potato",
			"comments": [
				"My potatoes were perfect. It can�t get any easier than this."
			]
		},
		{
			"title": "Microwave Potato Corn Chowder",
			"comments": []
		},
		{
			"title": "Migas \"Crumbs\"",
			"comments": []
		},
		{
			"title": "Mixed Fruit Salad",
			"comments": []
		},
		{
			"title": "Mixed Grain Bread",
			"comments": [
				"I found that with 1 cup of water, I needed a total of 4 1/2 cups of flour.  Also that whole wheat can substitute for rye flour, which is sometimes hard to find."
			]
		},
		{
			"title": "Mock Sour Cream",
			"comments": [
				"Game changer!!"
			]
		},
		{
			"title": "Mock Southern Sweet Potato Pie",
			"comments": [
				"Filling is delicious -- crust is tough as a boot! Use the filling over a ginger snap in cupcake papers for a better result."
			]
		},
		{
			"title": "Mousse a la Banana",
			"comments": []
		},
		{
			"title": "Mozz Totz",
			"comments": []
		},
		{
			"title": "Muffins (from Better Baking Mix)",
			"comments": []
		},
		{
			"title": "Naan",
			"comments": []
		},
		{
			"title": "New England Johnny Cake",
			"comments": []
		},
		{
			"title": "New Orleans Red Beans",
			"comments": []
		},
		{
			"title": "No Bake Breakfast Cookies",
			"comments": [
				"None",
				"I used honey when making the recipe.  I would recommend using a bit less than the stated amount, maybe 1/3c.  It seemed too sweet.  Held together well and is good for grab and go breakfast"
			]
		},
		{
			"title": "No-Bake Cookies",
			"comments": [
				"when i used this recipe i just went with the gut feelings. OH!!! And also reduced the milk",
				"The flavor just wasn't that good.",
				"TOO much dry milk, needs to be reduced to ONE HALF cup. They were nasty with the full cup."
			]
		},
		{
			"title": "Oat Bran Muffins",
			"comments": [
				"Not very moist or sweet. Participants did not like them. Spent extra money and time to locate \"oat bran,\" not worth it.",
				"Not moist, nor very sweet. The healthy muffin and cookie recipes can be frustrating because they often don't have much flavor, and look uncooked after baking."
			]
		},
		{
			"title": "Oat Snack Cakes",
			"comments": [
				"Very tasty, easy to use as a snack."
			]
		},
		{
			"title": "Oat! My Tropical Pizza",
			"comments": []
		},
		{
			"title": "Oatmeal Bread",
			"comments": []
		},
		{
			"title": "Oatmeal Raisin Muffins",
			"comments": [
				"I also added some cinnamon to the recipe and used Whole wheat flour- 3/4 cup, 1/2 cup all purpose flour. Also, I add just a pinch of cinnamon sugar to the top as well.",
				"The recipe needs spices. I added 1.5 t cinnamon and about 1/2 t nutmeg. I also used 3/4 cup whole wheat flour and the rest AP flour, which was ok. After the spices the recipe was good.",
				"The muffins were great.  Blueberries would be great in this recipe."
			]
		},
		{
			"title": "Okra and Greens",
			"comments": []
		},
		{
			"title": "Old Fashioned Bread Pudding",
			"comments": [
				"We loved making this in the microwave -- so fast!  I think it needs a lot of cinnamon and/or dried fruit to be really delicious.",
				"Classes really liked this.  Could be great with other dried fruits!"
			]
		},
		{
			"title": "Oprah's Outtasight Salad",
			"comments": [
				"This is a very good twist on an old favorite! Very tasty & fresh! I made it for use with SNAP recipients & it was so good that I made it again for my family & friends!",
				"We tried this first at a staff meeting and we were all very impressed.",
				"Nuts are a bit expensive, but this calls for only 2 tablespoons, and their flavor and texture add a lot.  This recipe is great because it allows room for creative choices."
			]
		},
		{
			"title": "Orange Banana Frosty",
			"comments": [
				"My kids loved this!"
			]
		},
		{
			"title": "Orange Cow",
			"comments": [
				"I wanted to find a recipe to promote healthy beverages (orange juice and milk) and came across the Orange Cow.  The kids LOVED the flavor, many said it tasted like an Orange Julius.  Also, only a handful of kids knew about nonfat dry milk and frozen orange juice concentrate, so that was a bonus teaching moment.  P.S. I found I didn't need to use as much water as was suggested."
			]
		},
		{
			"title": "Orange Delight Juice",
			"comments": [
				"I thought it tasted great.  My daughter loved it and it was super easy."
			]
		},
		{
			"title": "Orange Honeyed Acorn Squash",
			"comments": []
		},
		{
			"title": "Oven Baked Sweet Potato Fries",
			"comments": []
		},
		{
			"title": "Oven-Baked Potato Pancakes",
			"comments": []
		},
		{
			"title": "Oven-Fried Yucca",
			"comments": []
		},
		{
			"title": "Oven-Roasted Vegetables",
			"comments": [
				"none"
			]
		},
		{
			"title": "Overnight Oatmeal",
			"comments": [
				"You could just soak the oatmeal overnight with the dried fruit and then add the walnuts and fresh fruit in the morning instead of cooking it. It saves time and preserves vital nutrients in the dried fruit."
			]
		},
		{
			"title": "Pancakes (from Better Baking Mix)",
			"comments": []
		},
		{
			"title": "Panned Cabbage",
			"comments": []
		},
		{
			"title": "Parmesan Chive Biscuits",
			"comments": [
				"I believe that using your own flour and baking power would make this recipe less expensive and should offer substitutions - I would cut the amount of cheese.  Not everyone can eat dairy and gluten flour."
			]
		},
		{
			"title": "Parsnip Soup",
			"comments": []
		},
		{
			"title": "Passover Rhubarb Cobbler",
			"comments": []
		},
		{
			"title": "Pasta Frittata with Peas",
			"comments": [
				"Bland taste, even with the addition of salt.  Easy to make but not worth the effort since your website has so many other good recipes."
			]
		},
		{
			"title": "Pasta Primavera",
			"comments": [
				"Quick, easy, and tasty!  Took 20 minutes total!"
			]
		},
		{
			"title": "Pasta Primavera II",
			"comments": []
		},
		{
			"title": "Pasta Primavera Salad",
			"comments": []
		},
		{
			"title": "Pasta Salad",
			"comments": [
				"Bell peppers are $1.64 each here and Pasta can be $1-2 for a box, this pricing is way off."
			]
		},
		{
			"title": "Pasta Vegetable Salad",
			"comments": []
		},
		{
			"title": "Pea Guacamole",
			"comments": []
		},
		{
			"title": "Pea Pesto",
			"comments": [
				"Spinach is not listed in the ingredients list or it should mention that it is optional. <br/>It tastes somewhat to salty. <br/>"
			]
		},
		{
			"title": "Peach Apple Crisp",
			"comments": [
				"Instructions state to bake about 20 minutes, but found it took over twice that amount of time before dish was bubbly & somewhat brown.  Oatmeal(a whole grain)could have been used in the recipe to make the topping even better."
			]
		},
		{
			"title": "Peach Cooler",
			"comments": [
				"The taste was very bland.  I did add a little vanilla which helped with flavor.  The drink was also not cold enough, it was like it needed ice to make it more refreshing."
			]
		},
		{
			"title": "Peach Crisp",
			"comments": [
				"This was delicious cold and hot (with a little vanilla ice cream on top).  I would try again using other fruits along with the peaches.  Very easy to make."
			]
		},
		{
			"title": "Peach Sauce ",
			"comments": []
		},
		{
			"title": "Peachy Peanut Butter Pita Pockets",
			"comments": [
				"The audience that I tested the recipe with said that it would be better to do it without the peaches, only with the apple and bananas.  They said peaches give the recipe a weird taste.  Next time I used it will be without the peaches.   <br/>Other than that is was very good."
			]
		},
		{
			"title": "Peachy Pops",
			"comments": []
		},
		{
			"title": "Peanut Butter 'n Fruit-wich",
			"comments": []
		},
		{
			"title": "Peanut Butter and Apple Wraps",
			"comments": []
		},
		{
			"title": "Peanut Butter Bananas",
			"comments": []
		},
		{
			"title": "Peanut Butter Bread",
			"comments": [
				"This makes a very large loaf of bread, it raises up nicely, is not flat like quick bread."
			]
		},
		{
			"title": "Peanut Butter Muffins",
			"comments": [
				"Made these over the weekend so we have an easy breakfast on hand this week.  Turned out very well!",
				"I think it would be better as a mini-muffin.  It's important to not overbake, as they get rather dry.",
				"The recipe is easy."
			]
		},
		{
			"title": "Pear in Orange Sauce",
			"comments": []
		},
		{
			"title": "Pear Kabobs with Strawberry Dipping Sauce",
			"comments": []
		},
		{
			"title": "Pear Party Salsa",
			"comments": []
		},
		{
			"title": "Pear PB&J Bouquet",
			"comments": []
		},
		{
			"title": "Pear Quesadillas",
			"comments": []
		},
		{
			"title": "Pear Rabbit",
			"comments": []
		},
		{
			"title": "Pears in a Pod",
			"comments": []
		},
		{
			"title": "Perfect Pumpkin Pancakes",
			"comments": []
		},
		{
			"title": "Peter Pumpkin Squares",
			"comments": [
				"Moist and flavorful",
				"Made this with high school students several times. They loved it!!!",
				"I've made this recipe twice and both times everyone loved it... I cut the sugar down to 1 cup instead of 1 1/2 cups to make it healthier... it was still yummy!"
			]
		},
		{
			"title": "Pico de Gallo",
			"comments": []
		},
		{
			"title": "Pineapple Angel Food Cake",
			"comments": []
		},
		{
			"title": "Pineapple Orange Frozen Yogurt",
			"comments": []
		},
		{
			"title": "Pineapple Rice Bake",
			"comments": [
				"A good, quick dessert (if you have cooked rice on hand).  We used boil-in-bag for time's sake."
			]
		},
		{
			"title": "Pineapple Zucchini Cake",
			"comments": [
				"I make this cake frequently for my food stamp classes.  Usually everyone loves this cake, even those who say they don't like zuchinni.  Sometimes I add 1/2 cup coconut which really adds to the flavor.  For church potlucks, I add a cream cheese icing and i"
			]
		},
		{
			"title": "Pink Party Salad",
			"comments": []
		},
		{
			"title": "Pocket Fruit Pies",
			"comments": []
		},
		{
			"title": "Popcorn Treats",
			"comments": []
		},
		{
			"title": "Potato Cakes",
			"comments": [
				"This recipe works and tastes better if the onions are cooked prior to use in the recipe. The flavor and texture is improved."
			]
		},
		{
			"title": "Potato Soup",
			"comments": [
				"The recipe is vague (six potatoes, what does that even mean?  Do you know how many kinds of potatoes there are?!)  It's easy to follow, didn't take so long.  However, the nutrition facts can't be accurate as margarine has trans fats, and the listed cost is ludicrous - the potatoes alone cost nearly $6.00.  Maybe it was accurate a decade ago, but perhaps it should be updated.  Either that or I'd like to shop where you're shopping.  However it was tasty and filling, should last my beau and I a few days.",
				"My potatos were all different sizes, so I had to guess at \"six potatos.\" I used about 2 1/2 pounds, and I think that was a little too much. You could spice the soup up a lot of different ways if you like. Good recipe!",
				"I would suggest that somewhere in the instructions that washing the vegetables should be added."
			]
		},
		{
			"title": "Potato Spinach Lasagna",
			"comments": []
		},
		{
			"title": "Potato, Black Bean, & Kale Skillet",
			"comments": []
		},
		{
			"title": "Pumpkin and Bean Soup",
			"comments": [
				"I tried the recipe once and look forward to using it this fall with education with Food Stamp eligible families",
				"I substituted dried red beans that I soaked, cooked and mashed. A little more work than opening a can of white beans but I liked the taste even better."
			]
		},
		{
			"title": "Pumpkin Angel Food Cake",
			"comments": []
		},
		{
			"title": "Pumpkin Bread",
			"comments": [
				"Participants really liked this recipe. Take out of the oven a few minutes before suggested time or it becomes dry very quickly.",
				"We used dried cherries instead of raisins - YUM!"
			]
		},
		{
			"title": "Pumpkin Chocolate Muffins",
			"comments": []
		},
		{
			"title": "Pumpkin Cookies",
			"comments": [
				"Pumpkin Spice is cheaper than all those individual ingredients, and  <br/>2 1/2 cups all-purpose flour are way cheaper than adding whole wheat flour! Cut the sugar in half because the raisins are plenty sweet. One egg is good enough for me, and I used butter not oil (but only because I use butter for everything!). <br/>",
				"With easy modifications this recipe can be made healthier.  The sugar can be reduced to half (3/4 cup), 100% whole wheat flour can be used entirely (2 3/4 cups,)and unsweetened applesauce can be substituted for the oil.  I add a third egg to increase the protein content and moisture and make 24 cookies instead of 48. The result is a lightly sweet, pleasant cake-like cookie that my clients have named \"muffin tops.\"  It would be helpful to have this modified version with the nutrition facts.",
				"The cookies were very moist.  I baked them the night before and they were a little sticky by morning.  Next time I will cut the amount of oil in half."
			]
		},
		{
			"title": "Pumpkin Mac & Cheese for One",
			"comments": []
		},
		{
			"title": "Pumpkin Pudding",
			"comments": [
				"I've made this recipe with many individuals and groups, from preschoolers at Head Start to seniors at nutrition sites.  Everyone loves it!",
				"I use this in the fall as a dip for apple slices"
			]
		},
		{
			"title": "Pumpkin Ricotta Stuffed Shells",
			"comments": []
		},
		{
			"title": "Purple Cow",
			"comments": []
		},
		{
			"title": "Quesadilla con Huevos",
			"comments": []
		},
		{
			"title": "Quick Black Bean Salad",
			"comments": []
		},
		{
			"title": "Quick Peach Cobbler",
			"comments": [
				"Very nice for a quick dessert."
			]
		},
		{
			"title": "Quinoa and Black Bean Salad",
			"comments": [
				"didnt have any lime juice or cumin - we dont care for green peppers - we substituted - lemon juice, garlic, paprika, then added carrots instead of the peppers.  sweetened the dressing with Stevia - 1/2 tsp. DELICIOUS!"
			]
		},
		{
			"title": "Rainbow Veggie Salad",
			"comments": []
		},
		{
			"title": "Ratatouille",
			"comments": []
		},
		{
			"title": "Red Beans and Rice",
			"comments": []
		},
		{
			"title": "Red Beans and Rice",
			"comments": []
		},
		{
			"title": "Red Lentil Latkes",
			"comments": []
		},
		{
			"title": "Refried Beans",
			"comments": []
		},
		{
			"title": "Rice Dessert",
			"comments": []
		},
		{
			"title": "Rice Pudding",
			"comments": []
		},
		{
			"title": "Rice Salad",
			"comments": []
		},
		{
			"title": "Rice-Crusted Pizza",
			"comments": [
				"I would recommend cooking the crust for 10 mins before putting the sauce on it.  I have found that this makes the crust a little crispier and helps it stick together better.  Other than that the recipe was great and easy to make."
			]
		},
		{
			"title": "Rise and Shine Cobbler",
			"comments": []
		},
		{
			"title": "Roasted Cauliflower",
			"comments": [
				"Really easy and tasty!"
			]
		},
		{
			"title": "Roasted Chickpeas (Garbanzo Beans)",
			"comments": []
		},
		{
			"title": "Roasted Herb Potatoes",
			"comments": [
				"Great recipe for introducing fresh or dried herbs and getting creative with them!",
				"Great recipe for introducing fresh or dried herbs and getting creative with them!"
			]
		},
		{
			"title": "Roasted Potatoes",
			"comments": []
		},
		{
			"title": "Roasted Pumpkin Seed Snack Mix",
			"comments": []
		},
		{
			"title": "Roasted Root Vegetables",
			"comments": [
				"I used beets, two types of turnips, sweet potato, 3 types of radishes, carrots, and onion. My toddler loved the flavor and could chew it easily.",
				"Nice to see a vegetarian receipe....thank you...",
				"This recipe was delicious! I made it with every root vegetable I could find in the grocery store and they all tasted excellent!"
			]
		},
		{
			"title": "Roasted Tomatoes with Herbs",
			"comments": []
		},
		{
			"title": "Salata Ma Jibna (Salad with Parmesan Cheese)",
			"comments": []
		},
		{
			"title": "Salsa Fresca",
			"comments": []
		},
		{
			"title": "Salsa Pinto Beans",
			"comments": []
		},
		{
			"title": "Salt-free All Purpose Blend",
			"comments": [
				"This spice blend is so versatile! I have used it as a base for dips made from yogurt, as a flavoring in casseroles, in salad dressings, on cooked meat. The quantity is never a problem, as we use it up VERY quickly!"
			]
		},
		{
			"title": "Sarah’s Green Bean Casserole ",
			"comments": []
		},
		{
			"title": "Savory Bread Pudding with Kale and Butternut Squash",
			"comments": []
		},
		{
			"title": "Scallion Rice",
			"comments": []
		},
		{
			"title": "Scalloped Potatoes",
			"comments": []
		},
		{
			"title": "Scalloped Potatoes II",
			"comments": []
		},
		{
			"title": "Scrambled Tofu",
			"comments": []
		},
		{
			"title": "Seared Greens",
			"comments": [
				"shouldn't the recipe read \"stir until thoroughly dry\", not \"wet\"?"
			]
		},
		{
			"title": "Seasoned Roasted Vegetables",
			"comments": []
		},
		{
			"title": "Sesame Turnips and Carrots",
			"comments": []
		},
		{
			"title": "Shake-A-Pudding",
			"comments": []
		},
		{
			"title": "Shirini",
			"comments": []
		},
		{
			"title": "Short Cut Lasagna",
			"comments": []
		},
		{
			"title": "Simmered Beans",
			"comments": []
		},
		{
			"title": "Simple Stuffed Peppers",
			"comments": [
				"My kids loved the taste of these peppers and helped me \"decorate\" them before cooking."
			]
		},
		{
			"title": "Skillet Lasagna",
			"comments": []
		},
		{
			"title": "Skillet Meals",
			"comments": []
		},
		{
			"title": "Skinny Pizza ",
			"comments": []
		},
		{
			"title": "Slow Cooker Beans",
			"comments": []
		},
		{
			"title": "Snappy Cole Slaw",
			"comments": [
				"This recipe had an enjoyable sweet and sour flavor. I added one small chopped apple to the recipe for added color and crunch. (This review is based on my trying this recipe in preparation for sharing it with others.)"
			]
		},
		{
			"title": "Soft Pretzels",
			"comments": []
		},
		{
			"title": "Somali Summer Salad",
			"comments": [
				"Although a bit unusual sounding, the ingredients can work well together.  Use firm tomatoes to maintain the \"crunch\" and texture.  With so many choices of apple and tomato varieties, you can tweak this recipe to your liking."
			]
		},
		{
			"title": "Soul-Healthy Cornbread",
			"comments": [
				"This cornbread is unusually sweet.  <br/> <br/>I think it would go well with foods that are spicy if you are looking for something to compliment a hotter flavor.  <br/> <br/>The biggest plus is that it uses buttermilk, so if you have leftover buttermilk this will take ca",
				"I think the calorie count must be wrong! <br/>It's got good ingredients, not a lot of oil, but the count per serving is crazy. <br/>"
			]
		},
		{
			"title": "South of the Border Dip",
			"comments": []
		},
		{
			"title": "South of the Border Salad",
			"comments": []
		},
		{
			"title": "Southern Banana Pudding",
			"comments": []
		},
		{
			"title": "Southwestern Pepper Cups",
			"comments": []
		},
		{
			"title": "Spaghetti and Spinach Pesto",
			"comments": []
		},
		{
			"title": "Spaghetti Squash with Tomatoes, Basil, and Parmesan",
			"comments": []
		},
		{
			"title": "Spanish Omelet",
			"comments": []
		},
		{
			"title": "Spanish Rice",
			"comments": []
		},
		{
			"title": "Speedy Burritos",
			"comments": []
		},
		{
			"title": "Spicy Baked Squash",
			"comments": [
				"Less is better with the added brown sugar."
			]
		},
		{
			"title": "Spicy Carrots and Squash",
			"comments": [
				"When the recipe states squash, it didn't specify, nor did it give recommendations. I also substituted peeled baby carrots (available on the WIC program), which decreased prep time."
			]
		},
		{
			"title": "Spicy Fruit Cup",
			"comments": []
		},
		{
			"title": "Spicy Okra",
			"comments": []
		},
		{
			"title": "Spinach and Mushroom Enchilada Casserole",
			"comments": [
				"delicious!!",
				"It was hard to find the banana peppers. It was omitted and it still tasted good. I will make it again. Not sure that it would be kid friendly, but me and my husband loved it!"
			]
		},
		{
			"title": "Spinach Black Bean Salad",
			"comments": []
		},
		{
			"title": "Spinach Potato Pancakes",
			"comments": []
		},
		{
			"title": "Spinach Rice Salad",
			"comments": []
		},
		{
			"title": "Spinach Salad with Apples and Eggs",
			"comments": []
		},
		{
			"title": "Spinach Salad with Apples and Raisins",
			"comments": []
		},
		{
			"title": "Spinach Stuffed Potatoes",
			"comments": []
		},
		{
			"title": "Spinach, Tomatoes, and Corn",
			"comments": []
		},
		{
			"title": "Splendid Fruit Salad",
			"comments": []
		},
		{
			"title": "Split Pea Soup",
			"comments": [
				"Good recipe.  Instead of only the onions, I sauteed the onions, celery, and carrots in canola oil first.  This brought out the flavors better. I don't usually use margarine when cooking oil is available.  Margarine adds a bit more flavor over oil.  I also"
			]
		},
		{
			"title": "Spring Vegetable Saute",
			"comments": []
		},
		{
			"title": "Spring Vegetable Soup",
			"comments": []
		},
		{
			"title": "Springtime Cereal",
			"comments": []
		},
		{
			"title": "Spunky Vegetable Pizza",
			"comments": [
				"I find the carrots to be too juicy and thus making the bread a bit mushy. I will admit that I used my own pizza dough"
			]
		},
		{
			"title": "Squash Salsa",
			"comments": [
				"I did not add the lemon or lime because I felt it would take away from the blending of flavors from vegetables. This recipe does not cheese at all! It is great on its own."
			]
		},
		{
			"title": "Squash Soup",
			"comments": []
		},
		{
			"title": "Squash Squares",
			"comments": []
		},
		{
			"title": "Squash-Apple Casserole",
			"comments": [
				"Granny Smith apples too tart.  I would use a sweeter apple next time."
			]
		},
		{
			"title": "Stewed Cauliflower, Tomatoes, and Onions",
			"comments": []
		},
		{
			"title": "Stovetop Tamale Pie",
			"comments": [
				"Very bland.  We added garlic, cumin, oregano, and black pepper, and used pinto beans with jalapeno -- it helped a lot!"
			]
		},
		{
			"title": "Strawberry Mango Feta Toast Points",
			"comments": []
		},
		{
			"title": "Strawberry S'Mores",
			"comments": []
		},
		{
			"title": "Stuffed Summer Squash",
			"comments": []
		},
		{
			"title": "Stuffed Tomatoes",
			"comments": []
		},
		{
			"title": "Sugar and Spice Cookies (from Better Baking Mix)",
			"comments": []
		},
		{
			"title": "Summer Breeze Smoothie",
			"comments": [
				"Adding 1/2 c. almond or peanut butter would *pump* this recipe up to a new nutritional level! It would satisfy the consumer for 4-5 hours, good for someone who has to work long hours before eating lunch!"
			]
		},
		{
			"title": "Summer Fruit Salad",
			"comments": [
				"Participants loved the ease of this recipe!"
			]
		},
		{
			"title": "Summer Italian Vegetables",
			"comments": []
		},
		{
			"title": "Summer Salad",
			"comments": []
		},
		{
			"title": "Summer Squash Medley",
			"comments": [
				"Served this over angel hair pasta. I don't even like squash, but this tastes good. I added dried basil and oregano, and Italian seasoning to the garlic powder."
			]
		},
		{
			"title": "Summer Squash Stir Fry",
			"comments": []
		},
		{
			"title": "Summer Squash, Italian Style",
			"comments": []
		},
		{
			"title": "Summer Vegetable Spaghetti",
			"comments": []
		},
		{
			"title": "Sunshine Rice",
			"comments": []
		},
		{
			"title": "Sunshine Salad",
			"comments": []
		},
		{
			"title": "Sure to Please Baked Eggs & Cheese",
			"comments": []
		},
		{
			"title": "Sweet Acorn Squash",
			"comments": []
		},
		{
			"title": "Sweet and Juicy Raisin Tapenade",
			"comments": []
		},
		{
			"title": "Sweet and Savory Peanut Butter Dip",
			"comments": []
		},
		{
			"title": "Sweet and Sour Cabbage",
			"comments": []
		},
		{
			"title": "Sweet and Sour Dressing",
			"comments": [
				"Fantastico y facil!"
			]
		},
		{
			"title": "Sweet and Sour Salad Dressing",
			"comments": []
		},
		{
			"title": "Sweet and Sour Vegetables",
			"comments": [
				"Very easy and tasty meal. We added pineapple chunks and water chesnuts. Plan to make again, may add tofu or chicken.",
				"Participants in the EFNEP program loved this recipe.  They stated they will make it again in their homes."
			]
		},
		{
			"title": "Sweet Cornmeal Pudding with Ginger and Cinnamon",
			"comments": []
		},
		{
			"title": "Sweet Potato and Apple Bake",
			"comments": []
		},
		{
			"title": "Sweet Potato Casserole",
			"comments": [
				"Too sweet; spices too intense."
			]
		},
		{
			"title": "Sweet Potato Casserole",
			"comments": []
		},
		{
			"title": "Sweet Potato Cheesecake",
			"comments": [
				"The instructions tell you to add vanilla but there is no vanilla listed in the ingredients. I added 1 teaspoon to the recipe I prepared."
			]
		},
		{
			"title": "Sweet Potato Custard",
			"comments": []
		},
		{
			"title": "Sweet Potato Pancakes",
			"comments": []
		},
		{
			"title": "Sweet Potato Pancakes with Balsamic Maple Mushrooms",
			"comments": []
		},
		{
			"title": "Sweet Potato Patties",
			"comments": []
		},
		{
			"title": "Sweet Potato Pie",
			"comments": []
		},
		{
			"title": "Sweet Potato Pone",
			"comments": []
		},
		{
			"title": "Sweetened Condensed Milk",
			"comments": []
		},
		{
			"title": "Taco Flavored Potatoes",
			"comments": [
				"The potatoes were a little dry and not as tender as I thought they'd be.  Perhaps they need more time in the oven, or some pre-oven time in the microwave.  We ate them all though.  Great leftovers using the potatoes and mexican rice recipe."
			]
		},
		{
			"title": "Tangy Crisp Vegetable and Pasta Salad",
			"comments": []
		},
		{
			"title": "Tangy Dressing",
			"comments": []
		},
		{
			"title": "Tangy Jicama Slaw",
			"comments": []
		},
		{
			"title": "Tastee Burgers",
			"comments": []
		},
		{
			"title": "Tasty Low-Fat Cream Soup",
			"comments": []
		},
		{
			"title": "Tasty Veggie Dip",
			"comments": [
				"great on burritos too"
			]
		},
		{
			"title": "Ten Minute Corn Chowder",
			"comments": []
		},
		{
			"title": "Terrific Bean Taco",
			"comments": []
		},
		{
			"title": "Thousand Island Dressing",
			"comments": []
		},
		{
			"title": "Three Bean Salad",
			"comments": []
		},
		{
			"title": "Three-Grain Peanut Bread",
			"comments": [
				"yummy bread high in nutrition. I pack it in my kids lunches and they love it. They also love helping to make it. <br/>"
			]
		},
		{
			"title": "Tic Tac Toe Veggie Pizza",
			"comments": []
		},
		{
			"title": "Tofu Salad",
			"comments": []
		},
		{
			"title": "Tofu with Broccoli ",
			"comments": []
		},
		{
			"title": "Tofu, Tomato and Spinach Soup",
			"comments": [
				"The whole family loved this soup!"
			]
		},
		{
			"title": "Tomato and Cucumber Salad",
			"comments": []
		},
		{
			"title": "Tomato and Garlic Omelet",
			"comments": []
		},
		{
			"title": "Tomato Basil and Bean Pasta Salad",
			"comments": [
				"I made this with two high school classes, and they actually liked it!  These kids eat hot dogs and pizza on a daily basis, so this was definitely a step in the right direction.  Used a lot of basil, but the fresh does make it a little yummier even though it's still pretty good with dried basil.  Also left out the walnuts and it didn't taste like it was missing anything.",
				"This was good and made a lot. I was out of fresh basil so I used 1/2 Tablespoon of dried basil. I also used rinsed and drained black beans. Served it with fruit pizza - another yummy."
			]
		},
		{
			"title": "Tomato Basil Bruschetta",
			"comments": [
				"The recipe itself was really good. However, a family that is on SNAP Ed may not have Extra Virgin Olive Oil or garlic cloves. Is there any way that we can substitute something (cheaper)?"
			]
		},
		{
			"title": "Tomato Basil Soup",
			"comments": []
		},
		{
			"title": "Tomato N' Cheese Pasta",
			"comments": [
				"Easy. I doubled the garlic and the basil."
			]
		},
		{
			"title": "Tortilla Chips and Bean Dip",
			"comments": []
		},
		{
			"title": "Tortilla Pizzas",
			"comments": [
				"Only added the red peppers as vegetables.  The others did not sound so good on a tortilla pizza.  But we made the potatoes and rice with it and the salsa as well and overall a great and filling combination"
			]
		},
		{
			"title": "Tostadas Delgadas",
			"comments": []
		},
		{
			"title": "Trail Mix Bars",
			"comments": []
		},
		{
			"title": "Trail Treat",
			"comments": []
		},
		{
			"title": "Tropical Morning Treat",
			"comments": []
		},
		{
			"title": "Turtle Apple",
			"comments": []
		},
		{
			"title": "Uncooked Tomato Sauce",
			"comments": [
				"This is the perfect summer recipe!  Most of the ingredients came directly from my garden!"
			]
		},
		{
			"title": "Vegetable Cheese Soup",
			"comments": []
		},
		{
			"title": "Vegetable Chili",
			"comments": []
		},
		{
			"title": "Vegetable Dipping Sauce",
			"comments": [
				"This dip is so tasty and creamy! It goes perfectly with raw Bok Choy, snap peas, or asparagus."
			]
		},
		{
			"title": "Vegetable Fried Rice",
			"comments": [
				"a good recipe and very economical. My daughter loves fried rice which is a good one dish meal, especially for lunch. May I suggest using a clove of minced garlic as well as chopped onion for extra flavor and vitamins. I usually form a small crater in the middle of the pan and scramble an egg inside before I finish stir frying the rest of the dish. It will add a touch of protein and color and make it suitable for breakfast too!"
			]
		},
		{
			"title": "Vegetable Medley with Salsa Dip",
			"comments": []
		},
		{
			"title": "Vegetable Pinwheels",
			"comments": []
		},
		{
			"title": "Vegetable Rice with Tomatoes",
			"comments": [
				"The rice was easy to make and the taste was just like at a restaurant, but for a fraction of the cost.  Would make again!"
			]
		},
		{
			"title": "Vegetable Salad",
			"comments": [
				"My students thought the salad was best when freshly made -- the vinegar taste was too strong after a few hours in the fridge."
			]
		},
		{
			"title": "Vegetable Snake",
			"comments": [
				"This recipe helped me get over my fear of snakes."
			]
		},
		{
			"title": "Vegetable Stew",
			"comments": []
		},
		{
			"title": "Vegetable Stroganoff",
			"comments": []
		},
		{
			"title": "Vegetarian Chili",
			"comments": []
		},
		{
			"title": "Vegetarian Collard Greens",
			"comments": []
		},
		{
			"title": "Vegetarian Matzo Ball Soup",
			"comments": [
				"I made this for a Jewish friend's birthday celebration and she really enjoyed it! (Although I admit that I added some more salt to it.)"
			]
		},
		{
			"title": "Vegetarian Spaghetti Sauce",
			"comments": []
		},
		{
			"title": "Vegetarian Stuffed Peppers",
			"comments": []
		},
		{
			"title": "Veggie Bean Wrap",
			"comments": [
				"I decided to substitute canned pineapple tidbits, drained, for the mango and that definitely cut the cost.  <br/>I also added in two roma tomatoes for more color and nutrition. And I used whole wheat tortillas.",
				"This was very good, although a little more pricey than it was labeled but not exceedingly so. I was able to find all of the produce at a Hispanic grocery store for much less than it would have been at the 'regular' store. And since I use dried beans anyway, it wasn't too bad cost-wise. A nice change from sandwiches and the kids loved it. We'll make it again.",
				"I would to say that this recipe is very easy to make and me and my daughter enjoys eating it."
			]
		},
		{
			"title": "Veggie Dip",
			"comments": [
				"I leave out the salt.  To blend I use my emulsifier.",
				"I can't believe how this turned out - you can't even tell it's cottage cheese!  I used dill weed instead of parsley. I will definitely make this again!",
				"Yum! This is a quick, easy and healthy alternative to ranch dressing/dip- and I thought it tasted better than most brands of store bought low-fat ranch. <br/> <br/>I didn't have garlic powder, so I chopped a glove of garlic and added that to the blender. Will definitely make this again!"
			]
		},
		{
			"title": "Veggie Noodles",
			"comments": [
				"The recipients didn't like the amount of carbohydrate in this recipe.  98g are a lot and how healthy can that really be for someone to have that many carb. in a meal.  Very easy to make and I used canned peas that  were washed off before I placed them in with the noddles."
			]
		},
		{
			"title": "Veggie Pizza Pita Pockets",
			"comments": []
		},
		{
			"title": "Veggie Quesadillas",
			"comments": []
		},
		{
			"title": "Veggie Stir-Fry with Turkey",
			"comments": []
		},
		{
			"title": "Veggie Stuffed Pita",
			"comments": []
		},
		{
			"title": "Waldorf Salad",
			"comments": []
		},
		{
			"title": "Watermelon Gazpacho",
			"comments": []
		},
		{
			"title": "Wheat Berry Chili",
			"comments": []
		},
		{
			"title": "White Sauce - Thin",
			"comments": []
		},
		{
			"title": "Whole Wheat Garlic Bread Sticks",
			"comments": []
		},
		{
			"title": "Whole Wheat Muffins",
			"comments": []
		},
		{
			"title": "Winter Crisp",
			"comments": []
		},
		{
			"title": "Wonderful Stuffed Potatoes",
			"comments": []
		},
		{
			"title": "Yogurt Berry Parfait",
			"comments": []
		},
		{
			"title": "Yogurt Pops",
			"comments": []
		},
		{
			"title": "Yogurt Popsicles",
			"comments": []
		},
		{
			"title": "Yogurt Smoothie in a Bag",
			"comments": []
		},
		{
			"title": "Yummy Bagels",
			"comments": []
		},
		{
			"title": "Yummy Bean Dip",
			"comments": []
		},
		{
			"title": "Zesty Citrus Coleslaw",
			"comments": [
				"As a resident of a primarily Asian community, the title of this recipe rather off-putting to me and the folks with whom I tried the recipe.  There is nothing Asian about it, as written.  Also, the (non-Asian) peanuts are a problem for many people.  To make the salad safer, more interesting and tasty (and a bit Asian), we substituted cashew nuts for peanuts and added a bit of ground ginger to the salad dressing.  With those variations, the salad was popular.  It is certainly simple to make and offers a nice balance of fruit, veggies and protein.  P.S.  I hope someone will correct the typos in the recipe."
			]
		},
		{
			"title": "Zesty Herb Salad Dressing",
			"comments": [
				"Very good!"
			]
		},
		{
			"title": "Zesty Orange Carrots",
			"comments": []
		},
		{
			"title": "Zesty Skillet Zucchini",
			"comments": []
		}
	]
}